Tarea 1 CFD/Simulaciones/Re_1000/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          30;
        startFace       19824;
    }
    outlet
    {
        type            patch;
        nFaces          30;
        startFace       19854;
    }
    wall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          492;
        startFace       19884;
    }
    obstacle
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          120;
        startFace       20376;
    }
    frontAndBack
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          20160;
        startFace       20496;
    }
)

// ************************************************************************* //
